{"title":"Erstellen von erweiterten Dokumentationen","content":"<p>Neben der eigentlichen Code-Dokumentation können Artikel, erweiterte Beschreibungen zu Namensräumen und benutzerdefinierte Navigationen erstellt werden.</p> \n<p>Erweiterte Dokumentationen können aus den folgenden Elementen bestehen.</p> \n<h3>Code-Dokumentation</h3> \n<p>Die Kern Aufgabe von <em>sharpDox</em> besteht darin ein Code-Dokumentation aus den Kommentaren einer C#-Solution zu erstellen. Wird als Eingabe während des Bauvorgangs eine \nSolution oder ein Projekt ausgewählt, baut <em>sharpDox</em> eine einfache Code-Dokumentation.</p> \n<p>Innerhalb einer komplexen Dokumentation kann die Code-Dokumentation in der benutzerdefinierten Navigation an einer beliebigen Stelle angehängt werden (siehe Punkt: Navigation).</p> \n<h3>Projektbeschreibung</h3> \n<p>Es kann eine Projektbeschreibung angelegt werden, die vom CHM- &amp; HTML-Exporter als Text für die Startseite genutzt wird. Diese Beschreibung kann in der Markdown-Syntax geschrieben werden.</p> \n<p>Dazu muss eine Datei mit dem Namen <code>default.sdpd</code> unterhalb der Eingabedatei liegen. Diese Datei wird während des Bauvorgangs eingelesen und den Exportern übergeben.</p> \n<h3>Namensraum-Beschreibungen</h3> \n<p><em>sharpDox</em> ermöglicht es auch für Namensräumen komplexere Beschreibungen zu erstellen. Dazu unterhalb der Eingabedatei eine Datei mit folgendem Format erstellt werden: <code>Namens.raum.Name.sdnd</code></p> \n<p>Für die Textformatierung kann die Markdown-Syntax genutzt werden.</p> \n<p>Die Datei mit dem Namen <code>SharpDox.Sdk.sdnd</code> wird zum Beispiel für den Namensraum <code>SharpDox.Sdk</code> genutzt.</p> \n<h3>Artikel</h3> \n<p>Neben Beschreibungen und der Dokumentation des Codes können in <em>sharpDox</em> auch Artikel Bestandteil einer Dokumentation sein.</p> \n<p>Artikel sind dabei zusätzliche Seiten innerhalb der Dokumentation, die über eine benutzerdefinierte Navigation erreichbar sind. Für Artikel ist es zwingend notwendig, dass eine Navigation erstellt wurde. Ansonsten werden Artikel während des Bauvorgangs nicht berücksichtigt.</p> \n<p>Um einen Artikel in einer Markdown-Syntax zu erstellen, muss lediglich eine Datei mit der Endung <code>.sda</code> in einem beliebigen Ordner erstellt werden. <em>sharpDox</em> erkennt alle in der Navigation referenzierten Artikel und liest diese automatisch ein. Siehe den Punkt <em>Navigation</em> für Informationen wie diese Artikel verlinkt werden können.</p> \n<h3>Tokens</h3> \n<p>Es kann eine Liste mit Tokens erstellt werden die innerhalb von Beschreibungen &amp; Artikeln genutzt werden können.</p> \n<p>Dazu muss eine Datei mit dem Namen <code>tokens.sdt</code> unterhalb der Eingabedatei liegen. Diese Datei wird während des Bauvorgangs eingelesen und den Exportern übergeben.</p> \n<p>Pro Zeile der Datei kann ein Token in der Form</p> \n<pre><code class=\"language-csharp line-numbers\">TokenName = TokenWert</code></pre> \n<p>angelegt werden. Dieser Token kann dann zum Beispiel in einem Artikel genutzt werden. \nDazu wird die folgende Syntax genutzt:</p> \n<pre><code class=\"language-csharp line-numbers\">{{&quot;token:BUILD_SERVER}}</code></pre> \n<p>Bitte das <code>&quot;</code> aus der oberen Syntax entfernen. Dieses wurde eingefügt, damit <em>sharpDox</em> nicht versucht das Beispiel zu ersetzen.</p> \n<h3>Links</h3> \n<p>Innerhalb von Beschreibungen und Artikeln können auf verschiedene Elemente innerhalb der Dokumentation verlinkt werden. Außerdem ist es möglich auf Bilder innerhalb der Lösung zu verlinken.</p> \n<p>Bitte erneut das <code>&quot;</code> aus den Beispielen entfernen.</p> \n<p>Namensraum: <code>{{&quot;namespace-link:[Fullname]}}</code></p> \n<blockquote> \n<p>Beispiel: <code>\\[LinkText]({{&quot;namespace-link:SharpDox.Sdk}})</code></p> \n</blockquote> \n<p>Typ: <code>{{&quot;type-link:[Identifier]}}</code></p> \n<blockquote> \n<p>Beispiel: <code>\\[LinkText]({{&quot;type-link:SharpDox.Sdk.Templater}})</code></p> \n</blockquote> \n<p>Artikel: <code>{{&quot;article-link:[ArticleFilename]}}</code></p> \n<blockquote> \n<p>Beispiel: <code>\\[LinkText]({{&quot;article-link:de.exporter-tutorial}})</code></p> \n</blockquote> \n<p>Bilder: Unterhalb der Eingabedatei können Bilder abgelegt werden die in Beschreibungen und Artikeln genutzt werden können. Die Bilder für die Dokumentation müssen mit dem Prefix <code>sdi.*</code> beginnen.</p> \n<blockquote> \n<p>Beispiel: <code>!\\[Shell]({{&quot;image-link:sdi.startSD.png}})</code></p> \n</blockquote> \n<h3>Navigation</h3> \n<p>Das wichtigste Element einer erweiterten Dokumentation ist die Navigation. Mit dieser kann festgelegt werden wie die Struktur der Dokumentation aufgebaut ist. Als Beispiel soll die Navigation der <em>sharpDox</em> Dokumentation genommen werden:</p> \n<pre><code class=\"language-csharp line-numbers\">-Einführung#de.introduction \n-Benutzer \n--Erstellen von erweiterten Dokumentationen#de.advanced-tutorial \n--Erstellen von mehrsprachigen Dokumentationen#de.multilang-tutorial \n-Entwickler \n--Erstellen eines Exporters#de.exporter-tutorial \n--API#..\\SharpDox.sln</code></pre> \n<p>Die Anzahl der anfänglichen Bindestriche gibt die Dokumentationsebene an. Gefolgt vom Namen des Menüpunktes. <code>-Einführung</code> bedeutet also, dass der Menüpunkt mit dem Namen <em>Einführung</em> an erster Stelle auf der obersten Ebene erstellt werden soll. Getrennt durch ein <code>#</code> folgt darauf der Name des Artikels, ohne Dateiendung, auf den der Menüpunkt verlinken soll. Ist kein Link angegeben, dient der Menüpunkt lediglich als &quot;Platzhalter&quot; (zum Beispiel die zweite Zeile <code>-Benutzer</code>). \nEs ist ebenfalls möglich absolute bzw. relative Pfade zu Artikeln anzugeben.</p> \n<pre><code class=\"language-csharp line-numbers\">--Erstellen von erweiterten Dokumentationen#de.advanced-tutorial</code></pre> \n<p>Bedeutet also, dass <em>sharpDox</em> auf der zweiten Ebene, unterhalb des darüberliegenden Elements, einen Menüpunkt mit dem Namen <em>Erstellen von erweiterten Dokumentationen</em> erstellt, der auf den Artikel <code>advanced-tutorial</code> verlinkt.</p> \n<p>Soll ein Menüpunkt auf eine Code-Dokumentation verlinken wird statt eines Artikelnamens der Pfad zur Solution/Projekt verwendet (relative Pfade sind möglich). (Im Beispiel: <code>--API#..\\SharpDox.sln</code>). \nEs ist möglich mehr als eine Code-Dokumentation zu verlinken.</p> \n<p>Um eine Dokumentation auf Basis dieser Navigation zu erstellen wird in <em>sharpDox</em> die Navigationsdatei als Eingabedatei genutzt.</p>"}