{"title":"Create advanced documentation","content":"<p>With <em>sharpDox</em> it is possible to create additional Articles, namespace descriptions and custom navigations for your documentation.</p> \n<p>Advanced documentation can consist of the following elements.</p> \n<h3>Code-Documentation</h3> \n<p><em>sharpDox</em> core task is the creation of a code documentation, which gets created out of the inline documentation of a c# solution. \nIf you use a solution/project as the input of a build process, <em>sharpDox</em> will create a simple code documentation.</p> \n<p>The code documentation can be included in a custom navigation (see: Navigation).</p> \n<h3>Project Description</h3> \n<p>It is possible to create a project description which will can be used by the exporters. It is possible to write the description in the markdown sytax.</p> \n<p>Just create a file with the name <em>default.sdpd</em> underneath the input file path. <em>sharpDox</em> will parse this file during the build process.</p> \n<h3>Namespace Description</h3> \n<p><em>sharpDox</em> is able to parse custom descriptions for namespaces. Just create a file with a <code>.sdnd</code> extension and write your description in the markdown syntax. <em>sharpDox</em> recognizes these files as namespace descriptions. \nIf you want a description for the namespace <code>SharpDox.Sdk</code>, create the file <code>SharpDox.Sdk.sdnd</code>.</p> \n<h3>Articles</h3> \n<p>Besides the code documentation and the description it is also possible to create articles. Articles are additional pages inside the documentation, which are accessible through a custom navigation. It is mandatory to create a custom navigation, if you use articles. Otherwise the articles get ignored.</p> \n<p>To create a articles just create a file with the <code>.sda</code> extension anywhere underneath the input file path. The file name is arbitrary. Use the markdown syntax for formatting. Please see <em>Navigation</em> for information on how to create a custom navigation.</p> \n<h3>Tokens</h3> \n<p>It is possible to create a list of tokens which are usable in descriptions and articles.</p> \n<p>Just create a file with the name <code>tokens.sdt</code> underneath the input file. This file gets parsed during the build process. \nCreate one element per line in the following formatting</p> \n<pre><code class=\"language-csharp line-numbers\">TokenName = TokenValue</code></pre> \n<p>For example this token can be used in articles. Use the following syntax to include a token:</p> \n<pre><code class=\"language-csharp line-numbers\">{{&quot;token:BUILD_SERVER}}</code></pre> \n<p>Please remove the <code>&quot;</code> from the example.</p> \n<h3>Links</h3> \n<p>You are able to create links inside descriptions and articles to link to other elements within the documention. It is also possible to include images. \nPlease use the following placeholders and remove the <code>&quot;</code> again.</p> \n<p>Namespace: <code>{{&quot;namespace-link:[Fullname]}}</code></p> \n<blockquote> \n<p>Example: <code>\\[LinkText]({{&quot;namespace-link:SharpDox.Sdk}})</code></p> \n</blockquote> \n<p>Type: <code>{{&quot;type-link:[Identifier]}}</code></p> \n<blockquote> \n<p>Example: <code>\\[LinkText]({{&quot;type-link:SharpDox.Sdk.Templater}})</code></p> \n</blockquote> \n<p>Article: <code>{{&quot;article-link:[ArticleFilename]}}</code></p> \n<blockquote> \n<p>Example: <code>\\[LinkText]({{&quot;article-link:exporter-tutorial}})</code></p> \n</blockquote> \n<p>Image: You are able to use images underneath the input file path within articles and descriptions. Just use the <code>sdi.</code> prefix to mark the image for <em>sharpDox</em>.</p> \n<blockquote> \n<p>Example: <code>!\\[Shell]({{&quot;image-link:sdi.startSD.png}})</code></p> \n</blockquote> \n<h3>Navigation</h3> \n<p>The navigation is the main element of any advanced documentation. The custom navigation file defines the structure of the documentation. The navigation of the <em>sharpDox</em> documentation is used for the following example:</p> \n<pre><code class=\"language-csharp line-numbers\">-Introduction#introduction \n-Users \n--Create advanced documentation#advanced-tutorial \n--Create multilanguage documentation#multilang-tutorial \n-Developers \n--Create a exporter#exporter-tutorial \n--API#..\\SharpDox.sln</code></pre> \n<p>The number hyphens indicates the level of the item followed by the name of the menu item. <code>-Introduction</code> means that the menu item with the name <code>Introduction</code> should be on the first position in the first level of the navigation. \nThe part behind the <code>#</code> defines the linked article. Use the article file name, without the extension. \nIf a menu item is missing the <code>#</code> part, it is just a &quot;placeholder&quot; (for example the second line: <code>-Users</code>). It is also possible to reference articles by its absolute and relative path.</p> \n<pre><code class=\"language-csharp line-numbers\">--Create advanced documentation#advanced-tutorial</code></pre> \n<p>This implies that <em>sharpDox</em> should create a child menu item with the name <em>Create advanced documentation</em> which is linked to the <code>advanced-tutorial</code> article.</p> \n<p>If you want a item to link to a code documentation, use the path to the solution/project instead of an article name (In the example above: <code>--API#..\\SharpDox.sln</code>). \nIt is possible to include more than one code documentation.</p> \n<p>To build an advanced documentation use the navigation file as the input file.</p>"}